<!-- dflook/terraform-github-actions {"workspace":"multiple_vars","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","backend":"0a2f520a4da57590143359db7391ad25fbc0af1dc55fae1adba28ce9ca1b0e4a","plan_job_ref":"Job Test actions using target, replace, and exclude #23 at https://github.com/dflook/terraform-github-actions/actions/runs/20955603377","plan_hash":"1048e1c58acc61b63042fc53efc472441258266de95f90e295ed1788db94102b","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __multiple_vars__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "KWz62FsCqA" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #23](https://github.com/dflook/terraform-github-actions/actions/runs/20955603377)
<details open><summary>Outputs</summary>

```hcl
count   = "gYewJJ8zeL"
foreach = "mxWULdR29v"
```
</details>